Repository: qwrtln/homm3bg-painting
Catalog: localizations/gold-golem.md/*.po
Languages: pl, ru

source: Neutrals
pl: Neutralne
ru: Нейтральные

source: The Process
pl: Proces
ru: Процесс

source: Conclusion
pl: Wniosek
ru: Вывод

source: A surprisingly fun Pharaoh to paint.
pl: Zaskakująco przyjemny Faraon do malowania.
ru: Неожиданно приятный Фараон для покраски.

source: https://paint-h3.qwrtln.nl/assets/images/gold-golem/gold-golem.webp
pl: https://pl.paint-h3.qwrtln.nl/assets/images/gold-golem/gold-golem.webp
ru: https://ru.paint-h3.qwrtln.nl/assets/images/gold-golem/gold-golem.webp

source: Gold
pl: Złote
ru: Золотые

source: Gold Golem
pl: Złoty Golem
ru: Золотой Голем

source: <small>Read in another language: [:pl:](https://pl.paint-h3.qwrtln.nl/posts/2025/02/złoty-golem/) [:ru:](https://ru.paint-h3.qwrtln.nl/posts/2025/02/золотой-голем/)</small>
pl: <small>Czytaj w innym języku: [:gb:](https://paint-h3.qwrtln.nl/posts/2025/02/gold-golem/) [:ru:](https://ru.paint-h3.qwrtln.nl/posts/2025/02/золотой-голем/)</small>
ru: <small>Читайте на другом языке: [:gb:](https://paint-h3.qwrtln.nl/posts/2025/02/gold-golem/) [:pl:](https://pl.paint-h3.qwrtln.nl/posts/2025/02/złoty-golem/)</small>

source: Painting muscles with metallics is a very rewarding experience - the gold catches light beautifully and accentuates the sculpted physique.
pl: Malowanie mięśni metalicznymi farbami jest bardzo satysfakcjonujące - złoto pięknie łapie światło i podkreśla wyrzeźbioną sylwetkę.
ru: Окрашивание мускулов металликами - очень благодарный опыт. Золото красиво улавливает свет и подчеркивает проработанную мускулатуру.

source: <div style="display: flex; min-width: 100%; align-items: center"> <div style="width: 50%; padding-top: 20px"> <img src="/assets/images/gold-golem/gold-golem.webp" style="width: 100%; display: block" /> </div> <div style="width: 50%; position: relative;"> <img src="/assets/images/gold-golem/card.webp" style="width: 100%; display: block"/> <a href="https://homm3bg.wiki/units/gold_golems" style="position: absolute; top: 0; left: 0; width: 100%; height: 100%; z-index: 10; display: block;"></a> </div> </div>
pl: <div style="display: flex; min-width: 100%; align-items: center"> <div style="width: 50%; padding-top: 20px"> <img src="/assets/images/gold-golem/gold-golem.webp" style="width: 100%; display: block" /> </div> <div style="width: 50%; position: relative;"> <img src="/assets/images/gold-golem/card.webp" style="width: 100%; display: block"/> <a href="https://homm3bg.wiki/pl/units/gold_golems" style="position: absolute; top: 0; left: 0; width: 100%; height: 100%; z-index: 10; display: block;"></a> </div> </div>

source: <details><summary>Click to see the unboxing video</summary> <video width="1280" height="720" controls preload="none"> <source src="/assets/videos/gold-golem.webm" type="video/webm"> </video> </details>
pl: <details><summary>Kliknij, aby zobaczyć wideo z rozpakowywania</summary> <video width="1280" height="720" controls preload="none"> <source src="/assets/videos/gold-golem.webm" type="video/webm"> </video> </details>
ru: <details><summary>Нажмите, чтобы посмотреть видео с распаковки</summary> <video width="1280" height="720" controls preload="none"> <source src="/assets/videos/gold-golem.webm" type="video/webm"> </video> </details>

source: The Plan
pl: Plan
ru: План

source: Most of the mini will be covered with metallics, which shine on their own. The usual zenithal priming helps bring out all the details of the mini.
pl: Większość figurki będzie pokryta metalicznymi farbami, które same w sobie błyszczą. Standardowy zenitalny podkład pomaga wydobyć wszystkie detale.
ru: Большая часть миниатюры будет покрыта металликами, которые сами по себе блестят. Обычный зенитальный грунт помогает выявить все детали миниатюры.

source: ![prime front](../assets/images/gold-golem/raw/1.webp){width="400px"} ///caption The hands are too pale, but other than that all the details are clearly visible. ///
pl: ![prime front](../assets/images/gold-golem/raw/1.webp){width="400px"} /// caption Dłonie są zbyt blade, ale poza tym wszystkie detale są wyraźnie widoczne. ///
ru: ![prime front](../assets/images/gold-golem/raw/1.webp){width="400px"} /// caption Руки слишком бледные, но кроме этого все детали четко видны. ///

source: ![prime back](../assets/images/gold-golem/raw/2.webp){width="400px"} ///caption The Pharaoh never skipped the leg day. ///
pl: ![prime back](../assets/images/gold-golem/raw/2.webp){width="400px"} /// caption Ten Faraon nigdy nie opuszczał dnia nóg. ///
ru: ![prime back](../assets/images/gold-golem/raw/2.webp){width="400px"} /// caption Этот Фараон никогда не пропускал день ног. ///

source: I started with covering the upper body with AK's old gold, then a layer of Reikland Fleshshade to darken the recesses, and then a final layer of Vallejo's gold.
pl: Zacząłem od pokrycia górnej części ciała starym złotem AK, następnie warstwą Reikland Fleshshade, aby przyciemnić zagłębienia. Na koniec warstwa złota Vallejo.
ru: Я начал с покрытия верхней части тела старым золотом от AK, затем слой Reikland Fleshshade для затемнения углублений, и в конце слой золота Vallejo.

source: ![chest](../assets/images/gold-golem/raw/3.webp){width="400px"} ///caption Those simple steps already make the golem's "skin" look good. ///
pl: ![chest](../assets/images/gold-golem/raw/3.webp){width="400px"} /// caption Te proste czynności już sprawiają, że "skóra" golema wygląda dobrze. ///
ru: ![chest](../assets/images/gold-golem/raw/3.webp){width="400px"} /// caption Эти простые шаги уже делают "кожу" голема привлекательной. ///

source: ![legs 1 layer](../assets/images/gold-golem/raw/4.webp){width="400px"} ///caption For comparison, legs with a single layer of old gold. ///
pl: ![legs 1 layer](../assets/images/gold-golem/raw/4.webp){width="400px"} /// caption Dla porównania, nogi z pojedynczą warstwą starego złota. ///
ru: ![legs 1 layer](../assets/images/gold-golem/raw/4.webp){width="400px"} /// caption Для сравнения, ноги с одним слоем старого золота. ///

source: ![legs many layers](../assets/images/gold-golem/raw/6.webp){width="400px"} ///caption Legs with all the layers. ///
pl: ![legs many layers](../assets/images/gold-golem/raw/6.webp){width="400px"} /// caption Nogi ze wszystkimi warstwami. ///
ru: ![legs many layers](../assets/images/gold-golem/raw/6.webp){width="400px"} /// caption Ноги со всеми слоями. ///

source: With Pharaoh clothes, one needs to be very careful with the fine details. I chose my thinnest synthetic brush for this task. Blue with azure for highlights for one part, gold for everything else.
pl: Przy ubiorze Faraona trzeba być bardzo ostrożnym z drobnymi detalami. Wybrałem mój najcieńszy syntetyczny pędzel do tego zadania. Niebieski z błękitnymi highlightami dla jednej części, złoto dla całej reszty.
ru: С одеждой Фараона нужно быть очень осторожным с мелкими деталями. Я выбрал свою самую тонкую синтетическую кисть для этой задачи. Синий с лазурными хайлайтами для одной части, золото для всего остального.

source: ![cap](../assets/images/gold-golem/raw/7.webp){width="400px"} ///caption Reikland Fleshshade again for face shading, and off-white for the eyes. ///
pl: ![cap](../assets/images/gold-golem/raw/7.webp){width="400px"} /// caption Ponownie Reikland Fleshshade do cieniowania twarzy i kremowa biel do oczu. ///
ru: ![cap](../assets/images/gold-golem/raw/7.webp){width="400px"} /// caption Снова Reikland Fleshshade для затенения лица и не совсем белый для глаз. ///

source: For the pants, I used the same colors as for the cap, with one difference: I opted for Agrax Earthshade to give it some depth.
pl: Dla majtek użyłem tych samych kolorów co dla nakrycia głowy, z jedną różnicą: wybrałem Agrax Earthshade, aby dodać głębi.
ru: Для трусов я использовал те же цвета, что и для головного убора, с одним отличием: я выбрал Agrax Earthshade, чтобы придать им глубину.

source: ![pants](../assets/images/gold-golem/raw/9.webp){width="400px"} ///caption With metallics, it's more difficult to make an even layer, into which wash can flow. ///
pl: ![pants](../assets/images/gold-golem/raw/9.webp){width="400px"} /// caption Z metalicznymi farbami trudniej jest stworzyć równą warstwę, w którą wash może wpłynąć. ///
ru: ![pants](../assets/images/gold-golem/raw/9.webp){width="400px"} /// caption С металликами сложнее создать ровный слой, в который может затечь ваш. ///

source: What was left, was the sand base. Dry-brushing and stippling helped give the sand texture and a consistent tone.
pl: Pozostała jeszcze piaskowa podstawka. Techniki dry-brush i stippling pomogły nadać piaskowi teksturę i spójny ton.
ru: Осталась еще песчаная основа. Техники драй-браш и стиплинг помогли придать песку текстуру и однородный тон.

source: ![final touches](../assets/images/gold-golem/raw/10.webp){width="400px"} ///caption A final look helps find places to fix. Look at the collar - metallics overspilled a little. ///
pl: ![final touches](../assets/images/gold-golem/raw/10.webp){width="400px"} /// caption Ostatnie spojrzenie pomaga znaleźć miejsca do poprawienia. Na kołnierzu widać rozlane złoto. ///
ru: ![final touches](../assets/images/gold-golem/raw/10.webp){width="400px"} /// caption Последний взгляд помогаетфиксировать места для исправления. Посмотрите на ворот - металлик переполнился немного. ///

source: Key learnings:
pl: Kluczowe lekcje:
ru: Ключевые выводы:

source: - Painting with metallics is rather straightforward. No wonder people opt for Non-Metallic Metal.
pl: - Malowanie metalikami jest nieskomplikowane. Nic dziwnego, że ludzie preferują podejście *Non-Metallic Metal*.
ru: - Покраска металликами относительно простая. Неудивительно, что люди предпочитают подход *Non-Metallic Metal.*

source: - Don't use your best brushes with metallics! Natural fur gets damaged all too easily.
pl: - Nie używaj swoich najlepszych pędzli do metalików! Naturalne włosie bardzo łatwo ulega uszkodzeniu.
ru: - Не используйте лучшие кисти для металликов! Натуральный мех слишком легко повреждается.
