Repository: qwrtln/homm3bg-painting
Catalog: localizations/first-seven.md/*.po
Languages: pl, ru

source: Lessons learned from the begining of the adventure.
pl: Wnioski wyciągnięte z początku przygody.
ru: Уроки, извлечённые из начала приключения.

source: https://paint-h3.qwrtln.nl/assets/images/first-seven.webp
pl: https://pl.paint-h3.qwrtln.nl/assets/images/first-seven.webp
ru: https://ru.paint-h3.qwrtln.nl/assets/images/first-seven.webp

source: First Seven Minis
pl: Pierwsza Siódemka
ru: Первая Семерка

source: <small>Read in another language: [:pl:](https://pl.paint-h3.qwrtln.nl/posts/2025/02/pierwsza-siódemka/) [:ru:](https://ru.paint-h3.qwrtln.nl/posts/2025/02/первая-семерка/)</small>
pl: <small>Czytaj w innym języku: [:gb:](https://paint-h3.qwrtln.nl/posts/2025/02/first-seven-minis/) [:ru:](https://ru.paint-h3.qwrtln.nl/posts/2025/02/первая-семерка/)</small>
ru: <small>Читайте на другом языке: [:gb:](https://paint-h3.qwrtln.nl/posts/2025/02/first-seven-minis/) [:pl:](https://pl.paint-h3.qwrtln.nl/posts/2025/02/pierwsza-siódemka/)</small>

source: ![first seven](../assets/images/first-seven.webp) /// caption Even amateur painting quality is better than bare plastic. It makes you want to play even more. ///
pl: ![first seven](../assets/images/first-seven.webp) /// caption Nawet amatorskie malowanie jest lepsze niż goły plastik. Aż chce się grać. ///
ru: ![first seven](../assets/images/first-seven.webp) /// caption Даже любительская покраска лучше чем голый пластик. Так и хочется играть. ///

source: Quick math: it took me about 3 months to paint 7 miniatures. At this pace, painting the whole game will take roughly 3 years. Let's see if this prediction holds true.
pl: Szybki rachunek: pomalowanie 7 figurek zajęło mi około 3 miesięcy. W tym tempie pomalowanie całej gry zajmie około 3 lat. Zobaczmy, czy ta prognoza się sprawdzi.
ru: Быстрая калькуляция: покраска 7 миниатюр заняла у меня около 3 месяцев. При таком темпе покраска всей игры займёт примерно 3 года. Посмотрим, сбудется ли этот прогноз.

source: Key takeaways so far:
pl: Najważniejsze wnioski:
ru: Ключевые выводы на данный момент:

source: - Artistry like this follows specific rules that anyone can learn. Following these rules will lead to decent results.
pl: - Ten rodzaj artyzmu rządzi się konkretnymi zasadami, których każdy może się nauczyć, a przestrzeganie ich prowadzi do przyzwoitych rezultatów.
ru: - Это искусство следует определённым правилам, которые может освоить каждый, а их соблюдение приводит к достойным результатам.

source: - No need to sweat over the details or quality, as long as you're having fun. Time flows surprisingly fast when you're laser-focused on completing the next miniature.
pl: - Nie ma co przejmować się szczegółami czy jakością, dopóki sprawia ci to przyjemność. Czas płynie zaskakująco szybko, gdy skupiasz się całkowicie na malowaniu kolejnej figurki.
ru: - Не стоит переживать о деталях или качестве, пока процесс доставляет удовольствие. Время течёт удивительно быстро, когда полностью сосредоточен на покраске следующей миниатюры.

source: - Online video tutorials have limited value unless they demonstrate painting something very similar to your project (so far I've found [one YouTuber](https://www.youtube.com/@olebrogger/search?query=heroes) who does this). Most tutorial creators use premium-quality miniatures and equipment that I either can't access or don't want to invest in. Naturally, their tutorials wouldn't look as spectacular if they used lower-quality materials.
pl: - Internetowe tutoriale wideo mają ograniczoną wartość, chyba że pokazują malowanie czegoś bardzo podobnego do twojego projektu (jak dotąd znalazłem [jednego YouTubera](https://www.youtube.com/@olebrogger/search?query=heroes), który to robi). Większość twórców tutoriali używa wysokiej jakości figurek i sprzętu, które są dla mnie niedostępne albo nie chcę w nie inwestować. Oczywiście, ich tutoriale nie wyglądałyby tak spektakularnie, gdyby używali materiałów niższej jakości.
ru: - Онлайн-видеоуроки имеют ограниченную ценность, если только они не показывают покраску чего-то очень похожего на ваш проект (пока я нашёл [одного ютубера](https://www.youtube.com/@olebrogger/search?query=heroes), который это делает). Большинство авторов уроков используют премиум-качества миниатюры и оборудование, которые мне либо недоступны, либо я не хочу в них инвестировать. Естественно, их уроки не выглядели бы так впечатляюще, если бы они использовали материалы более низкого качества.

source: - A quality paintbrush is the most crucial piece of equipment. While you can compromise on other materials, a poor-quality brush will limit your progress.
pl: - Dobrej jakości pędzel to najważniejszy element wyposażenia. Wprawdzie na innych materiałach można oszczędzić, niemniej jednak kiepskiej jakości pędzel ograniczy twoje rezultaty.
ru: - Качественная кисть - это самый важный инструмент. Хотя на других материалах можно сэкономить, кисть низкого качества ограничит ваши результаты.

source: - If you have a scientific mind and are new to artistic work, this hobby will challenge your brain in a positive way. You'll develop skills from parts of your mind that don't get much exercise normally. It's like the reverse of teaching a creative friend how to code.
pl: - Jeśli masz ścisły umysł i zaczynasz przygodę ze sztuką, to hobby pozytywnie pobudzi twój mózg. Rozwiniesz umiejętności z tych obszarów, które zazwyczaj nie są zbyt aktywne. Coś jak uczenie kreatywnego przyjaciela programowania, tyle że na odwrót.
ru: - Если у вас научный склад ума и вы начинаете путь в искусстве, это хобби положительно стимулирует ваш мозг. Вы разовьёте навыки в тех областях, которые обычно не очень активны. Что-то вроде обучения творческого друга программированию, только наоборот.

source: I hope this helps. Pick up that brush and see where it takes you.
pl: Mam nadzieję, że pomogłem. Łap ten pędzel i zobacz, co z tego wyniknie.
ru: Надеюсь, я помог. Берите кисть и посмотрите, что из этого получится.
