Repository: qwrtln/homm3bg-painting
Catalog: localizations/mummy.md/*.po
Languages: pl, ru

source: Neutrals
pl: Neutralne
ru: Нейтральные

source: The Process
pl: Proces
ru: Процесс

source: Conclusion
pl: Wniosek
ru: Вывод

source: Ever felt like painting your own rendition of Iron Maiden's Eddie?
pl: Malowanie własnej wersji Eddiego z Iron Maiden.
ru: Нарисовать собственную версию Эдди из Iron Maiden.

source: https://paint-h3.qwrtln.nl/assets/images/mummy-front.webp
pl: https://pl.paint-h3.qwrtln.nl/assets/images/mummy-front.webp
ru: https://ru.paint-h3.qwrtln.nl/assets/images/mummy-front.webp

source: Mummy
pl: Mumia
ru: Мумия

source: <small>Read in another language: [:pl:](https://pl.paint-h3.qwrtln.nl/posts/2025/02/mumia/) [:ru:](https://ru.paint-h3.qwrtln.nl/posts/2025/02/мумия/)</small>
pl: <small>Czytaj w innym języku: [:gb:](https://paint-h3.qwrtln.nl/posts/2025/02/mummy/) [:ru:](https://ru.paint-h3.qwrtln.nl/posts/2025/02/мумия/)</small>
ru: <small>Читайте на другом языке: [:gb:](https://paint-h3.qwrtln.nl/posts/2025/02/mummy/) [:pl:](https://pl.paint-h3.qwrtln.nl/posts/2025/02/mumia/)</small>

source: Painting this mini reminded me of [Eddie](https://en.wikipedia.org/wiki/Eddie_(Iron_Maiden)), Iron Maiden's mascot in their Powerslave album.
pl: Malowanie tej figurki przypomniało mi [Eddiego](https://pl.wikipedia.org/wiki/Eddie_(Iron_Maiden)), maskotkę Iron Maiden z albumu Powerslave.
ru: Покраска этой миниатюры напомнила мне [Эдди](https://ru.wikipedia.org/wiki/Эдди_(Iron_Maiden)), маскот Iron Maiden из альбома Powerslave.

source: <details><summary>Click to see the unboxing video</summary> <video width="1280" height="720" controls preload="none"> <source src="/assets/videos/mummy.webm" type="video/webm"> </video> </details>
pl: <details><summary>Kliknij, aby zobaczyć wideo z rozpakowywania</summary> <video width="1280" height="720" controls preload="none"> <source src="/assets/videos/mummy.webm" type="video/webm"> </video> </details>
ru: <details><summary>Нажмите, чтобы посмотреть видео с распаковки</summary> <video width="1280" height="720" controls preload="none"> <source src="/assets/videos/mummy.webm" type="video/webm"> </video> </details>

source: See Mummies on the [Wiki](https://homm3bg.wiki/units/mummies).
pl: Zobacz Mumie na [Wiki](https://homm3bg.wiki/pl/units/mummies).
ru: Посмотрите Мумии на [Вики](https://homm3bg.wiki/units/mummies).

source: The lighting in these miniature photos has a yellow tint due to experimental lighting setup. It will only get better.
pl: Oświetlenie na tych zdjęciach ma żółtawy odcień z powodu eksperymentalnego ustawienia świateł. Z czasem będzie lepiej.
ru: Освещение на этих фотографиях имеет желтоватый оттенок из-за экспериментальной настройки света. Со временем будет лучше.

source: The Plan
pl: Plan
ru: План

source: As usual, I start with zenithal priming:
pl: Jak zwykle, zaczynam od podkładu zenitalnego:
ru: Как обычно, начинаю с зенитального грунтования:

source: Black spray all-around the mini in short gusts
pl: Krótkie pryśnięcia czarnym sprayem dookoła figurki
ru: Короткие распыления черного спрея вокруг миниатюры

source: 2-3 even shorter gusts of white
pl: 2-3 jeszcze krótsze pryśnięcia białym
ru: 2-3 еще более коротких распыления белым

source: Areas hard to reach with a brush become visible
pl: Miejsca trudno dostępne dla pędzla stają się widoczne
ru: Труднодоступные для кисти места становятся видимыми

source: ![mummy primed](../assets/images/raw/mummy-primed.webp) /// caption I finally learned how to spray both economically and effectively ///
pl: ![mummy primed](../assets/images/raw/mummy-primed.webp) /// caption Nauczyłem się oszczędnie i skutecznie pryskać sprayem ///
ru: ![mummy primed](../assets/images/raw/mummy-primed.webp) /// caption Я наконец научился распылять краску экономно и эффективно ///

source: The card art shows clear resemblance to Ancient Egypt and pharaohs, calling for sand-like tones with hints of nobility.
pl: Grafika karty wykazuje wyraźne podobieństwo do starożytnego Egiptu i faraonów, wskazując piaskowe odcienie ze szlachetnymi akcentami.
ru: Изображение на карте явно напоминает Древний Египет и фараонов, передавая песчаные оттенки с благородными акцентами.

source: ![mummy palette](../assets/images/raw/mummy-palette.webp) /// caption Initial palette choice ///
pl: ![mummy palette](../assets/images/raw/mummy-palette.webp) /// caption Początkowy dobór palety ///
ru: ![mummy palette](../assets/images/raw/mummy-palette.webp) /// caption Начальный выбор палитры ///

source: ![mummy colors](../assets/images/raw/mummy-colors.webp) /// caption Mixing up base color for those venerable bandages ///
pl: ![mummy colors](../assets/images/raw/mummy-colors.webp) /// caption Mieszanie koloru bazowego na dostojne bandaże ///
ru: ![mummy colors](../assets/images/raw/mummy-colors.webp) /// caption Смешивание базового цвета для почтенных бинтов ///

source: Starting with the bandages proved straightforward.
pl: Rozpoczęcie od bandaży okazało się najprostsze.
ru: Начать с бинтов оказалось несложно.

source: ![mummy base](../assets/images/raw/mummy-base.webp) /// caption Base color needs a second coat for full coverage ///
pl: ![mummy base](../assets/images/raw/mummy-base.webp) /// caption Kolor bazowy wymaga drugiej warstwy dla pełnego krycia ///
ru: ![mummy base](../assets/images/raw/mummy-base.webp) /// caption Базовый цвет требует второго слоя для полного покрытия ///

source: Protruding bandages make natural highlight targets. The forgiving texture allows room for brush imprecision.
pl: Wystające bandaże stanowią naturalne miejsca dla rozjaśnień. Względnie przyjazna tekstura wybacza niedokładności w ruchach pędzla.
ru: Выступающие бинты служат естественными местами для хайлайтов. Достаточно податливая текстура прощает неточности движений кисти.

source: Metallics presented the main challenge, particularly the scepter. While reference colors appear similar, available paints required adaptation:
pl: Metaliczne elementy stanowiły główne wyzwanie, szczególnie berło. Choć kolory na obrazku wydają się podobne, dostępne farby wymagały nieco kreatywności:
ru: Металлические элементы представляли главную сложность, особенно скипетр. Хотя цвета на изображении кажутся похожими, доступные краски требовали некоторой креативности:

source: Applied thin gold metallic over brown base for subtle shine
pl: Nałożyłem cienką warstwę złotego metaliku na brązową bazę, aby uzyskać subtelny połysk
ru: Нанёс тонкий слой золотого металлика по коричневой базе для получения тонкого блеска

source: Pure gold metallic for remaining metallic areas
pl: Czysty złoty metalik na pozostałe metaliczne obszary
ru: Чистый золотой металлик для остальных металлических участков

source: Key learnings:
pl: Kluczowe lekcje:
ru: Ключевые выводы

source: Gold metallic requires dedicated base layer for proper coverage
pl: Złoty metalik wymaga odpowiedniej warstwy bazowej dla właściwego krycia
ru: Золотой металлик требует правильного базового слоя для нормального покрытия

source: Reference colors deserve more literal interpretation
pl: Kolory na obrazku zasługują na bardziej dosłowną interpretację
ru: Цвета на изображении заслуживают более буквальной интерпретации

source: Snake head tip could benefit from white and orange reflections instead of uniform brown
pl: Końcówka głowy węża wyglądałaby lepiej z białymi i pomarańczowymi rozjaśnieniami zamiast jednolitego brązu
ru: Кончик головы змеи смотрелся бы лучше с белыми и оранжевыми высветлениями вместо однородного коричневого

source: Remember: we're creating an illusion of reality
pl: Należy pamiętać: tworzymy iluzję rzeczywistości, a nie rzeczywistość
ru: Нужно помнить: мы создаём иллюзию реальности, а не саму реальность
