Repository: qwrtln/homm3bg-painting
Catalog: localizations/boar.md/*.po
Languages: pl, ru

source: First mini with a large 5 cm base.
ru: Первая миниатюра с большой основой 5 см.

source: https://paint-h3.qwrtln.nl/assets/images/boar-1.webp
pl: https://pl.paint-h3.qwrtln.nl/assets/images/boar-1.webp
ru: https://ru.paint-h3.qwrtln.nl/assets/images/boar-1.webp

source: Neutrals
pl: Neutralne
ru: Нейтральные

source: Bronze
pl: Brązowe
ru: Коричневые

source: Boar
pl: Dzik
ru: Боров

source: <small>Read in another language: [:pl:](https://pl.paint-h3.qwrtln.nl/posts/2025/02/dzik/) [:ru:](https://ru.paint-h3.qwrtln.nl/posts/2025/02/боров/)</small>
pl: <small>Czytaj w innym języku: [:gb:](https://paint-h3.qwrtln.nl/posts/2025/02/boar/) [:ru:](https://ru.paint-h3.qwrtln.nl/posts/2025/02/боров/)</small>
ru: <small>Читайте на другом языке: [:gb:](https://paint-h3.qwrtln.nl/posts/2025/02/boar/) [:pl:](https://pl.paint-h3.qwrtln.nl/posts/2025/02/dzik/)</small>

source: My first mini with a large 5 cm base. I kept falling into the "just one more brush stroke" trap.
pl: Moja pierwsza figurka z dużą, 5-centymetrową podstawką. Ciągle wpadałem w pułapkę "jeszcze tylko jedno pociągnięcie pędzlem".
ru: Моя первая попытка с миниатюрой с большой основой 5 см. Я постоянно попадал в ловушку «ещё один мазок кистью».

source: <details><summary>Click to see the unboxing video</summary> <video width="1280" height="720" controls preload="none"> <source src="/assets/videos/boar.webm" type="video/webm"> </video> </details>
pl: <details><summary>Kliknij, aby zobaczyć wideo z rozpakowywania</summary> <video width="1280" height="720" controls preload="none"> <source src="/assets/videos/boar.webm" type="video/webm"> </video> </details>
ru: <details><summary>Нажмите, чтобы посмотреть видео с распаковки</summary> <video width="1280" height="720" controls preload="none"> <source src="/assets/videos/boar.webm" type="video/webm"> </video> </details>

source: See Boars on the [Wiki](https://homm3bg.wiki/units/boars).
pl: Zobacz Dziki na [Wiki](https://homm3bg.wiki/pl/units/boars) (rym Brzechwy godzien).
ru: Посмотрите Боровы на [Вики](https://homm3bg.wiki/units/boars).

source: Despite my efforts, matching the original colors was nearly impossible, especially for the animal's fur. One must master the dry-brush technique on simpler subjects before attempting more formidable creatures like dragons.
pl: Pomimo moich starań, odwzorowanie oryginalnych kolorów okazało się omal niemożliwe, szczególnie w przypadku sierści zwierzęcia. Trzeba opanować technikę dry-brush na prostszych modelach, zanim podejmie się próbę malowania bardziej okazałych stworów, takich jak smoki.
ru: Несмотря на все мои усилия, подобрать оригинальные цвета было практически невозможно, особенно для шерсти животного. Прежде чем браться за более сложных существ вроде драконов, нужно освоить технику сухой кисти на более простых объектах.

source: The Process
pl: Proces
ru: Процесс

source: I started with the base colors (though skipping some details like the beast's fangs) without planning the entire process.
pl: Zacząłem od kolorów bazowych (pomijając niektóre detale, jak dzika [*bardzo ostre*] kły) bez planowania całego procesu.
ru: Я начал с базовых цветов (пропустив некоторые детали, например клыки зверя), не планируя весь процесс.

source: ![boar base](../assets/images/boar-base.webp) /// caption Base colors with zenithal priming visible on the base ///
pl: ![boar base](../assets/images/boar-base.webp) /// caption Kolory bazowe z widocznym zenitalnym podkładem na podstawce ///
ru: ![boar base](../assets/images/boar-base.webp) /// caption Базовые цвета с видимым *zenithal priming* на основании ///

source: I purposefully made the fur dark (brown + black) to create contrast with the orange highlights added later. After initial attempts, I abandoned the black lowlights as the results were underwhelming. The second layer was painted with orange + brown to match the card's color, and the final highlights were applied using dry-brushing with pure orange.
pl: Celowo zrobiłem ciemną sierść (brąz + czerń), aby stworzyć kontrast z rudawymi rozjaśnieniami dodanymi później. Po pierwszych próbach zrezygnowałem z czarnych pasemek, ponieważ efekty były mało zadowalające. Druga warstwa została pomalowana mieszanką pomarańczowego i brązowego, aby dopasować się do koloru z karty, a końcowe rozjaśnienia zostały nałożone techniką dry-brush czystym pomarańczowym.
ru: Я намеренно сделал шерсть тёмной (коричневый + чёрный), чтобы создать контраст с оранжевыми хайлайтами, добавленными позже. После первых попыток я отказался от чёрных теней, так как результаты были неубедительными. Второй слой был нанесён оранжевым + коричневым, чтобы соответствовать цвету карты, а финальные блики были нанесены сухой кистью чистым оранжевым.

source: What remained were the facial details of both beast and rider, proper highlights for the goblin's skin, edge highlights on the saddle, and armor details. With so many similar colors, choosing the appropriate pallette was challenging.
pl: Pozostały jeszcze szczegóły mordy bestii i twarzy jeźdźca, odpowiednie rozjaśnienia skóry goblina, krawędzie siodła oraz detale zbroi. Przy tak wielu podobnych kolorach, wybór odpowiedniej palety był wyzwaniem.
ru: Оставалось проработать детали морды зверя и лица наездника, правильные блики на коже гоблина, подсветить края седла и детали доспехов. С таким количеством похожих цветов выбор подходящей палитры был непростой задачей.

source: The base is painted in desert tan with Agrax Earthshade in the recesses. The stones are black with a touch of blue for a slight grey appearance.
pl: Podstawka jest pomalowana pustynnym beżem (desert tan) z Agrax Earthshade w zagłębieniach. Kamienie są pomalowane mieszanką czarnego z odrobiną niebieskiego dla uzyskania lekko szarego wyglądu.
ru: Основание окрашено в пустынный бежевый цвет (desert tan) с Agrax Earthshade в углублениях. Камни чёрные с небольшим добавлением синего для создания слегка серого оттенка.

source: Conclusion
pl: Wniosek
ru: Вывод

source: I shouldn't hesitate to use stronger highlights. Additionally, distinguishing between similar colors should be planned before starting the project.
pl: Powinienem robić nieco mocniejsze rozjaśnienia. Poza tym rozróżnienie między podobnymi kolorami powinno być zaplanowane przed rozpoczęciem malowania.
ru: Мне не стоит бояться использовать более сильные хайлайты. Кроме того, различия между похожими цветами следует планировать до начала работы над проектом.

source: Having a wife who is a designer is invaluable - she helps me break through creative blocks.
pl: A żona projektant to skarb - służy jako skuteczny łom kreatywności.
ru: А жена-дизайнер - это золото: служит отличным рычагом для творчества.
