Repository: qwrtln/homm3bg-painting
Catalog: localizations/rogue.md/*.po
Languages: ru

source: Neutrals
ru: Нейтральные

source: Bronze
ru: Коричневые

source: Starting a new hobby.
ru: Начало нового хобби.

source: https://paint-h3.qwrtln.nl/assets/images/rogue_front.jpeg
ru: https://ru.paint-h3.qwrtln.nl/assets/images/rogue_front.jpeg

source: Rogue
ru: Разбойник

source: I started painting neutral units to gain some experience first.
ru: Я начал покрывать краской миниатюры нейтральных юнитов, чтобы сначала набраться опыта.

source: My first ever painted Heroes mini. Overall, very happy with the result. I like how the shading and highlhting turned out, especially the cloak, boots, trousers, and even the face. That said, you can see beginner's unsteady hand in the metallic details. The base ended up a bit too glossy as well — probably from overusing the wash.
ru: Моя первая покрашенная миниатюра. В целом, я очень доволен результатом. Особенно мне понравились тени и блики на плаще, ботинках, штанах и даже на лице. Однако, если мы посмотрим на металлические детали, то заметна неуверенная рука новичка. Подставка тоже вышла слишком глянцевой — скорее всего, из-за избыточного использования *wash*.

source: Painting time: 7 h
ru: Время покраски: 7 ч

source: See Rogues on the [Wiki](https://homm3bg.wiki/units/rogues).
ru: Посмотрите Разбойников на [Вики](https://homm3bg.wiki/units/rogues).

source: <details><summary>Click to see the unboxing video</summary> <video width="1280" height="720" controls preload="none"> <source src="/assets/videos/rogue.webm" type="video/webm"> </video> </details>
ru: <details><summary>Нажмите, чтобы посмотреть видео с распаковки</summary> <video width="1280" height="720" controls preload="none"> <source src="/assets/videos/rogue.webm" type="video/webm"> </video> </details>
