Repository: qwrtln/homm3bg-painting
Catalog: localizations/rust-dragon.md/*.po
Languages: pl, ru

source: Neutrals
pl: Neutralne
ru: Нейтральные

source: The Process
pl: Proces
ru: Процесс

source: Conclusion
pl: Wniosek
ru: Вывод

source: The Plan
pl: Plan
ru: План

source: Key learnings:
pl: Kluczowe lekcje:
ru: Ключевые выводы

source: The second mightiest creature in the game
pl: Druga najpotężniejsza istota w grze
ru: Второе самое могущественное существо в игре

source: https://paint-h3.qwrtln.nl/assets/images/rust-dragon-front.webp
pl: https://pl.paint-h3.qwrtln.nl/assets/images/rust-dragon-front.webp
ru: https://ru.paint-h3.qwrtln.nl/assets/images/rust-dragon-front.webp

source: Azure
pl: Błękitne

source: Rust Dragon
pl: Rdzawy Smok
ru: Ржавый Дракон

source: <small>Read in another language: [:pl:](https://pl.paint-h3.qwrtln.nl/posts/2025/02/rdzawy-smok/) [:ru:](https://ru.paint-h3.qwrtln.nl/posts/2025/02/ржавый-дракон/)</small>
pl: <small>Czytaj w innym języku: [:gb:](https://paint-h3.qwrtln.nl/posts/2025/02/rust-dragon/) [:ru:](https://ru.paint-h3.qwrtln.nl/posts/2025/02/ржавый-дракон/)</small>
ru: <small>Читайте на другом языке: [:gb:](https://paint-h3.qwrtln.nl/posts/2025/02/rust-dragon/) [:pl:](https://pl.paint-h3.qwrtln.nl/posts/2025/02/rdzawy-smok/)</small>

source: While Rust Dragons ranked as the third strongest unit in the video game, their position was swapped with Crystal Dragons in the board game version.
pl: Rdzawe Smoki to trzecia najsilniejsza jednostka w grze wideo. Ich miejsce zostało zamienione z Kryształowymi Smokami w wersji planszowej.
ru: Ржавые Драконы занимали позицию третьего самого сильного юнита в видеоигре. Их место было заменено на Кристальных Драконов в настольной версии.

source: <details><summary>Click to see the unboxing video</summary> <video width="1280" height="720" controls preload="none"> <source src="/assets/videos/rust-dragon.webm" type="video/webm"> </video> </details>
pl: <details><summary>Kliknij, aby zobaczyć wideo z rozpakowywania</summary> <video width="1280" height="720" controls preload="none"> <source src="/assets/videos/rust-dragon.webm" type="video/webm"> </video> </details>
ru: <details><summary>Нажмите, чтобы посмотреть видео с распаковки</summary> <video width="1280" height="720" controls preload="none"> <source src="/assets/videos/rust-dragon.webm" type="video/webm"> </video> </details>

source: See Rust Dragons on the [Wiki](https://homm3bg.wiki/units/rust_dragons).
pl: Zobacz Rdzawe Smoki na [Wiki](https://homm3bg.wiki/pl/units/rust_dragons).
ru: Посмотрите Ржавых Драконов на [Вики](https://homm3bg.wiki/units/trolls).

source: This miniature is significantly larger than most others, so it requires a customized approach. First, I'll cover the large areas of the same color using a cat tongue brush, and then I'll move on to the details.
pl: Ta figurka jest znacznie większa niż większość pozostałych, więc wymaga zindywidualizowanego podejścia. Najpierw pokryję duże obszary tego samego koloru używając pędzla typu 'koci jęzk', a następnie przejdę do szczegółów.
ru: Эта миниатюра значительно больше большинства других, поэтому требует особого подхода. Сначала я покрою большие области одного цвета кистью 'кошачий язычок', а затем перейду к деталям.

source: Looking at the reference card, the dragon has orange scales. A mix of orange with a splash of brown should make a good base color.
pl: Patrząc na obrazek na karcie, smok ma pomarańczowe łuski. Mieszanka pomarańczowego z odrobiną brązowego powinna dać dobry kolor bazowy.
ru: Глядя на изображение на карте, у дракона оранжевая чешуя. Смесь оранжевого с небольшим добавлением коричневого должна дать хороший базовый цвет.

source: Scales
pl: Łuski
ru: Чешуя

source: I covered the entire dragon's body using a large cat tongue brush.
pl: Pokryłem całe ciało smoka używając dużego pędzla typu 'koci język'.
ru: Я покрыл все тело дракона большой кистью 'кошачий язычок'.

source: ![base thin](../assets/images/rust-dragon/rust-dragon-01.webp) /// caption The color is weak, it will require multiple coats. ///
pl: ![base thin](../assets/images/rust-dragon/rust-dragon-01.webp) /// caption Kolor jest słaby, będzie wymagał kilku warstw. ///
ru: ![base thin](../assets/images/rust-dragon/rust-dragon-01.webp) /// caption Цвет слабый, потребуется несколько слоев. ///

source: Apply as many layers as needed for full coverage.
pl: Nałóż tyle warstw, ile potrzeba do pełnego krycia.

source: ![base thick](../assets/images/rust-dragon/rust-dragon-02.webp) /// caption Several layers later. ///
pl: ![base thick](../assets/images/rust-dragon/rust-dragon-02.webp) /// caption Kilka warstw później. ///
ru: ![base thick](../assets/images/rust-dragon/rust-dragon-02.webp) /// caption Несколько слоев спустя. ///

source: Finish with a matching wash to darken the recesses between the scales.
pl: Zakończ odpowiednim wash'em, aby przyciemnić zagłębienia między łuskami.
ru: Завершите соответствующим wash'ем, чтобы затемнить углубления между чешуйками.

source: ![base washed](../assets/images/rust-dragon/rust-dragon-03.webp) /// caption Reikland Fleshshade wash works its magic. ///
pl: ![base washed](../assets/images/rust-dragon/rust-dragon-03.webp) /// caption Wash Reikland Fleshshade robi swoje. ///
ru: ![base washed](../assets/images/rust-dragon/rust-dragon-03.webp) /// caption Wash Reikland Fleshshade творит чудеса. ///

source: Wings
pl: Skrzydła
ru: Крылья

source: The wings need a brighter color with gradient-like transitions around the bone structure. First, I covered the areas not directly adjacent to the dragon's body.
pl: Skrzydła potrzebują jaśniejszego koloru z gradientowymi przejściami wokół struktury kostnej. Najpierw pokryłem obszary nie przylegające bezpośrednio do ciała smoka.
ru: Крылья нуждаются в более ярком цвете с градиентными переходами вокруг костной структуры. Сначала я покрыл области, не прилегающие непосредственно к телу дракона.

source: ![](../assets/images/rust-dragon/rust-dragon-04.webp) /// caption Base layer for the wings. ///
pl: ![](../assets/images/rust-dragon/rust-dragon-04.webp) /// caption Warstwa bazowa na skrzydłach. ///
ru: ![](../assets/images/rust-dragon/rust-dragon-04.webp) /// caption Базовый слой для крыльев. ///

source: ![](../assets/images/rust-dragon/rust-dragon-07.webp) /// caption More coats with darker edges. ///
pl: ![](../assets/images/rust-dragon/rust-dragon-07.webp) /// caption Więcej warstw z ciemniejszymi krawędziami. ///
ru: ![](../assets/images/rust-dragon/rust-dragon-07.webp) /// caption Больше слоев с более темными краями. ///

source: At this stage, I realized it would be better to cover all the wings with the same color and use glazing around the bone structure. However, not all is lost. Highlights will give the wings more volume, and the transitions can still be smoothed out.
pl: Na tym etapie zdałem sobie sprawę, że lepiej byłoby pokryć całe skrzydła tym samym kolorem i użyć glaze'a wokół struktury kostnej. Jednak nie wszystko stracone. *Highlighty* nadadzą skrzydłom nieco objętości, a przejścia nadal można wygładzić.
ru: На этом этапе я понял, что лучше покрыть все крылья одним цветом и использовать glaze вокруг костной структуры. Однако не всё потеряно. *Хайлайты* придадут крыльям немного объема, а переходы все еще можно сгладить.

source: ![](../assets/images/rust-dragon/rust-dragon-08.webp) /// caption Initial wing highlights. ///
pl: ![](../assets/images/rust-dragon/rust-dragon-08.webp) /// caption Początkowe highlighty na skrzydłach. ///
ru: ![](../assets/images/rust-dragon/rust-dragon-08.webp) /// caption Начальные хайлайты на крыльях. ///

source: ![](../assets/images/rust-dragon/rust-dragon-09.webp) /// caption Inner highlights. ///
pl: ![](../assets/images/rust-dragon/rust-dragon-09.webp) /// caption Wewnętrzne highlighty. ///
ru: ![](../assets/images/rust-dragon/rust-dragon-09.webp) /// caption Внутренние хайлайты. ///

source: Claws
pl: Pazury
ru: Когти

source: The claws are relatively straightforward to paint. I'll add weathering and highlights in a later stage.
pl: Pazury są stosunkowo łatwe do malowania. Dodam ślady zębu czasu i highlight na późniejszym etapie.
ru: Когти относительно просто покрасить. Следы износа и хайлайт добавлю на более позднем этапе.

source: ![](../assets/images/rust-dragon/rust-dragon-10.webp) /// caption I left the head unpainted to focus on it later. ///
pl: ![](../assets/images/rust-dragon/rust-dragon-10.webp) /// caption Zostawiłem głowę niepomalowaną, aby zająć się nią później. ///
ru: ![](../assets/images/rust-dragon/rust-dragon-10.webp) /// caption Я оставил голову неокрашенной, чтобы заняться ею позже.

source: Base
pl: Podstawka
ru: Подставка

source: The base for this miniature is quite complex. It features a building-like structure, earth, stones, skulls, and snow in the reference picture. I started with the building.
pl: Podstawa tej miniatury jest dość złożona. Na obrazku karty znajduje się konstrukcja przypominająca budynek, ziemia, kamienie, czaszki i śnieg. Zacząłem od budynku.
ru: База этой миниатюры довольно сложная. На референсе изображена конструкция, похожая на здание, земля, камни, черепа и снег. Я начал со здания.

source: ![](../assets/images/rust-dragon/rust-dragon-14.webp) /// caption Applied grey with a hint of blue, azure around the edges, and dry-brushed white for texture. ///
pl: ![](../assets/images/rust-dragon/rust-dragon-14.webp) /// caption Nałożyłem szary z odrobiną niebieskiego, błękitny wokół krawędzi, i dry-brush bielą dla tekstury. ///
ru: ![](../assets/images/rust-dragon/rust-dragon-14.webp) /// caption Нанёс серый с оттенком синего, лазурный вокруг краёв, и сделал dry-brush белым для текстуры. ///

source: ![](../assets/images/rust-dragon/rust-dragon-15.webp) /// caption Both sides need careful dry-brushing. ///
pl: ![](../assets/images/rust-dragon/rust-dragon-15.webp) /// caption Obie strony wymagają starannego dry-brusha. ///
ru: ![](../assets/images/rust-dragon/rust-dragon-15.webp) /// caption Обе стороны требуют аккуратного dry-brush. ///

source: ![](../assets/images/rust-dragon/rust-dragon-17.webp) /// caption The stones in the back were painted without the blue tint. ///
pl: ![](../assets/images/rust-dragon/rust-dragon-17.webp) /// caption Kamienie z tyłu zostały pomalowane bez niebieskiego odcienia. ///
ru: ![](../assets/images/rust-dragon/rust-dragon-17.webp) /// caption Камни на заднем плане были покрашены без синего оттенка. ///

source: For the ground, I chose a mud-like color with patches of melting snow. I used AK's Ice Sparkles for the snow effect.
pl: Dla podłoża wybrałem kolor przypominający błoto z płatami topniejącego śniegu. Do efektu śniegu użyłem Ice Sparkles od AK.
ru: Для основания я выбрал цвет, похожий на грязь с проталинами тающего снега. Для эффекта снега я использовал Ice Sparkles от AK.

source: ![](../assets/images/rust-dragon/rust-dragon-19.webp) /// caption Earth with patches of melting snow. ///
pl: ![](../assets/images/rust-dragon/rust-dragon-19.webp) /// caption Ziemia z płatami topniejącego śniegu. ///
ru: ![](../assets/images/rust-dragon/rust-dragon-19.webp) /// caption Земля с проталинами тающего снега. ///

source: ![](../assets/images/rust-dragon/rust-dragon-20.webp) /// caption Skulls of unfortunate adventurers inside. ///
pl: ![](../assets/images/rust-dragon/rust-dragon-20.webp) /// caption Czaszki niefortunnych poszukiwaczy przygód w środku. ///
ru: ![](../assets/images/rust-dragon/rust-dragon-20.webp) /// caption Черепа неудачливых искателей приключений внутри. ///

source: Head
pl: Łeb
ru: Голова

source: The head is the focal point of the miniature, so its details and highlights should be the most prominent. I carefully painted the beast's snout, applied the strongest highlights, and added a glow effect to the eyes.
pl: Łeb to najważniejszy punkt miniatury, więc jego detale i highlighty powinny być najbardziej wyraziste. Starannie pomalowałem pysk bestii, nałożyłem najmocniejsze highlighty i dodałem efekt świecenia do oczu.
ru: Голова - это центральная точка миниатюры, поэтому её детали и хайлайты должны быть самыми выразительными. Я тщательно прокрасил морду зверя, нанёс самые сильные хайлайты и добавил эффект свечения глаз.

source: ![](../assets/images/rust-dragon/rust-dragon-23.webp) /// caption Snout with glowing eyes. ///
pl: ![](../assets/images/rust-dragon/rust-dragon-23.webp) /// caption Pysk ze świecącymi oczami. ///
ru: ![](../assets/images/rust-dragon/rust-dragon-23.webp) /// caption Морда со светящимися глазами. ///

source: Finally, I painted the head's spikes. I achieved the weathering effect using Agrax Earthshade wash, which I then applied to all the remaining thorns.
pl: Na końcu pomalowałem kolce na głowie. Efekt postarzenia uzyskałem przy pomocy wash Agrax Earthshade, który następnie nałożyłem na wszystkie pozostałe ciernie.
ru: Наконец я покрасил шипы на голове. Эффект старения я получил с помощью ваш Agrax Earthshade, который затем нанес на все оставшиеся шипы.

source: ![](../assets/images/rust-dragon/rust-dragon-25.webp) /// caption Weathered thorns complete the miniature. ///
pl: ![](../assets/images/rust-dragon/rust-dragon-25.webp) /// caption Postarzałe kolce dopełniają miniaturę. ///
ru: ![](../assets/images/rust-dragon/rust-dragon-25.webp) /// caption Состаренные шипы завершают миниатюру. ///

source: Use a cat tongue brush for large surfaces to save time
pl: Używaj pędzla typu 'koci język' do dużych powierzchni, aby zaoszczędzić czas
ru: Используйте кошачий язычок для больших поверхностей, чтобы сэкономить время

source: Painting eyes is manageable with the right brush
pl: Malowanie oczu jest wykonalne przy odpowiednim pędzlu
ru: Покраска глаз выполнима с правильной кистью

source: Creating gradient transitions is easier with glazing than by hand
pl: Tworzenie przejść gradientowych jest łatwiejsze przy użyciu *glaze* niż ręcznie
ru: Создание градиентных переходов легче с помощью *глейз*, чем вручную

source: Designer wife is gold, but friends letting you try some gear you haven't bought yet, that's silver
pl: Żona-projektantka to złoto, ale przyjaciele pozwalający wypróbować sprzęt, którego jeszcze nie kupiłeś, to srebro
ru: Жена-дизайнер - это золото, но друзья, позволяющие попробовать снаряжение, которое ты еще не купил - это серебро
