Repository: qwrtln/homm3bg-painting
Catalog: localizations/halfling.md/*.po
Languages: ru

source: Neutrals
ru: Нейтральные

source: Bronze
ru: Коричневые

source: The diminutive Frodo no one wants to paint.
ru: Крошечный Фродо, которого никто не хочет красить.

source: https://paint-h3.qwrtln.nl/assets/images/halfling/halfling.webp
ru: https://ru.paint-h3.qwrtln.nl/assets/images/halfling/halfling.webp

source: Halfling
ru: Полурослик

source: <small>Read in another language: [:pl:](https://pl.paint-h3.qwrtln.nl/posts/2025/02/niziołek/) [:ru:](https://ru.paint-h3.qwrtln.nl/posts/2025/02/полурослик/)</small>
ru: <small>Читайте на другом языке: [:gb:](https://paint-h3.qwrtln.nl/posts/2025/02/halfling/) [:pl:](https://pl.paint-h3.qwrtln.nl/posts/2025/02/niziołek/)</small>

source: A tiny but challenging miniature to paint.
ru: Маленькая, но сложная миниатюра для покраски.

source: <details><summary>Click to see the unboxing video</summary> <video width="1280" height="720" controls preload="none"> <source src="/assets/videos/halfling.webm" type="video/webm"> </video> </details>
ru: <details><summary>Нажмите, чтобы посмотреть видео с распаковки</summary> <video width="1280" height="720" controls preload="none"> <source src="/assets/videos/halfling.webm" type="video/webm"> </video> </details>

source: All the details are painted reasonably well. The face, on the other hand, is in a league of its own, which my skills can't match up to. The eyes could obviously be improved, but I'd rather leave them as they are, so that I can compare them with my future work and see the progress.
ru: Все детали прокрашены довольно хорошо. Лицо, с другой стороны, находится в совершенно другой лиге, до которой мои навыки не дотягивают. Глаза, очевидно, можно было бы улучшить, но я предпочитаю оставить их как есть, чтобы я мог сравнить их с моими будущими работами и увидеть прогресс.

source: See Halflings on the [Wiki](https://homm3bg.wiki/units/halflings).
ru: Посмотрите Полуросликов на [Вики](https://homm3bg.wiki/units/halflings).
