Repository: qwrtln/homm3bg-painting
Catalog: localizations/sharpshooter.md/*.po
Languages: pl, ru

source: Neutrals
pl: Neutralne
ru: Нейтральные

source: The Process
pl: Proces
ru: Процесс

source: Conclusion
pl: Wniosek
ru: Вывод

source: Key learnings:
pl: Kluczowe lekcje:
ru: Ключевые выводы:

source: Ready to serve in the Forest Guard.
pl: Gotowy do służby w Straży Leśnej.
ru: Готов служить в Лесной Страже.

source: https://paint-h3.qwrtln.nl/assets/images/sharpshooter/sharpshooter-front.webp
pl: https://pl.paint-h3.qwrtln.nl/assets/images/sharpshooter/sharpshooter-front.webp
ru: https://ru.paint-h3.qwrtln.nl/assets/images/sharpshooter/sharpshooter-front.webp

source: Sharpshooter
pl: Strzelec
ru: Снайпер

source: <small>Read in another language: [:pl:](https://pl.paint-h3.qwrtln.nl/posts/2025/03/strzelec/) [:ru:](https://ru.paint-h3.qwrtln.nl/posts/2025/03/снайпер/)</small>
pl: <small>Czytaj w innym języku: [:gb:](https://paint-h3.qwrtln.nl/posts/2025/03/sharpshooter/) [:ru:](https://ru.paint-h3.qwrtln.nl/posts/2025/03/снайпер/)</small>
ru: <small>Читайте на другом языке: [:gb:](https://paint-h3.qwrtln.nl/posts/2025/03/sharpshooter/) [:pl:](https://pl.paint-h3.qwrtln.nl/posts/2025/03/strzelec/)</small>

source: A flamboyant cloak is always fun to paint.
pl: Okazała peleryna to zawsze przyjemność do malowania.
ru: Роскошную накидку всегда весело красить.

source: <div style="display: flex; min-width: 100%; align-items: center"> <div style="width: 50%; padding-top: 20px"> <img src="/assets/images/sharpshooter/sharpshooter-transparent.webp" style="width: 100%; display: block" /> </div> <div style="width: 50%; position: relative;"> <img src="/assets/images/sharpshooter/card.webp" style="width: 100%; display: block"/> <a href="https://homm3bg.wiki/units/sharpshooters" style="position: absolute; top: 0; left: 0; width: 100%; height: 100%; z-index: 10; display: block;"></a> </div> </div>
pl: <div style="display: flex; min-width: 100%; align-items: center"> <div style="width: 50%; padding-top: 20px"> <img src="/assets/images/sharpshooter/sharpshooter-transparent.webp" style="width: 100%; display: block" /> </div> <div style="width: 50%; position: relative;"> <img src="/assets/images/sharpshooter/card.webp" style="width: 100%; display: block"/> <a href="https://homm3bg.wiki/pl/units/sharpshooters" style="position: absolute; top: 0; left: 0; width: 100%; height: 100%; z-index: 10; display: block;"></a> </div> </div>

source: <details><summary>Click to see the unboxing video</summary> <video width="1280" height="720" controls preload="none"> <source src="/assets/videos/sharpshooter.webm" type="video/webm"> </video> </details>
pl: <details><summary>Kliknij, aby zobaczyć wideo z rozpakowywania</summary> <video width="1280" height="720" controls preload="none"> <source src="/assets/videos/sharpshooter.webm" type="video/webm"> </video> </details>
ru: <details><summary>Нажмите, чтобы посмотреть видео с распаковки</summary> <video width="1280" height="720" controls preload="none"> <source src="/assets/videos/sharpshooter.webm" type="video/webm"> </video> </details>

source: I need to row back on my previous statements regarding the limited helpfulness of YouTube tutorials. [Vince Venturella's guide to highlighting](https://youtu.be/W8uCKcF3aUc) was incredibly helpful. Key conclusion: we're painting light, not actual colors.
pl: Muszę wycofać się z moich wcześniejszych stwierdzeń dotyczących nieprzydatności tutoriali z YouTube'a. [Poradnik Vince'a Venturelli na temat highlightów](https://youtu.be/W8uCKcF3aUc) jest niesamowicie pomocny. Kluczowy wniosek: malujemy światło, a nie rzeczywiste kolory.
ru: Мне нужно отказаться от своих прежних утверждений о бесполезности туториалов с YouTube. [Руководство Винса Вентуреллы по хайлайтам](https://youtu.be/W8uCKcF3aUc) невероятно полезно. Ключевой вывод: мы рисуем свет, а не реальные цвета.

source: Let's start with a tip on motivation: it's a lot harder to procrastinate when you paint with friends.
pl: Zacznijmy od porady dotyczącej motywacji: o wiele trudniej jest prokrastynować, gdy malujesz z przyjaciółmi.
ru: Начнём с совета по мотивации: гораздо сложнее откладывать на потом, когда красишь вместе с друзьями.

source: ![base thin](../assets/images/sharpshooter/01.webp) /// caption A makeshift painting workshop for two on a kitchen table. ///
pl: ![base thin](../assets/images/sharpshooter/01.webp) /// caption Prowizoryczny warsztat malarski dla dwóch osób na kuchennym stole. ///
ru: ![base thin](../assets/images/sharpshooter/01.webp) /// caption Импровизированная мастерская для двоих на кухонном столе. ///

source: To progress quickly, first paint big surfaces with a big brush. The cloak and the bow are obvious choices (flat brown and flat green). The rest is gun metal for chain mail, and black + purple for leather clothes. I wonder if actual medieval sharpshooters dressed so stylishly.
pl: Aby szybko zrobić postęp, najpierw maluj duże powierzchnie dużym pędzlem. Peleryna i łuk to oczywiste wybory (bazowy brąz i bazowa zieleń). Reszta to gun metal na kolczugę, oraz czarny + fiolet na skórzane ubrania. Zastanawiam się, czy średniowieczni strzelcy naprawdę ubierali się tak stylowo.
ru: Чтобы быстро продвигаться, сначала покрась большие поверхности большой кистью. Плащ и лук — очевидный выбор (плоский коричневый и плоский зеленый). Остальное — ган-метал для кольчуги и черный + фиолетовый для кожаной одежды. Интересно, одевались ли настоящие средневековые снайперы так стильно.

source: ![base thin](../assets/images/sharpshooter/02.webp) /// caption Those small details left to paint are quite time-consuming. ///
pl: ![base thin](../assets/images/sharpshooter/02.webp) /// caption Te małe szczegóły pozostałe do pomalowania są dość czasochłonne. ///
ru: ![base thin](../assets/images/sharpshooter/02.webp) /// caption Эти мелкие детали, оставшиеся для покраски, довольно трудоемки. ///

source: ![base thin](../assets/images/sharpshooter/03.webp) /// caption Base layers done. See that cup in the background? It's golden now, ha-ha. ///
pl: ![base thin](../assets/images/sharpshooter/03.webp) /// caption Warstwy bazowe gotowe. Widzisz ten kubek w tle? Teraz jest złoty, ha-ha. ///
ru: ![base thin](../assets/images/sharpshooter/03.webp) /// caption Базовые слои готовы. Видишь ту чашку на заднем плане? Теперь она золотая, ха-ха. ///

source: With base layers done, I progressed to highlighting using orange on brown, yellow on green, purple on black, and steel on gun metal. This time, I used wash sparingly: only on the base and in the recesses of the bow (which in reality would be holes). Also, don't forget to dry-brush your rocks. This technique is so awesome it should be illegal.
pl: Położywszy warstwy bazowe, przeszedłem do rozjaśnień używając pomarańczowego na brązowym, żółtego na zielonym, fioletowego na czarnym i srebrnego na gun metalu. Tym razem oszczędnie użyłem washa: tylko na podstawce i w zagłębieniach łuku (które w rzeczywistości byłyby otworami). Należy pamiętać też o dry-brushu na kamieniach. Ta technika jest tak świetna, że powinni jej zakazać.
ru: После нанесения базовых слоёв, я перешёл к хайлайтам, используя оранжевый по коричневому, жёлтый по зелёному, фиолетовый по чёрному и серебряный по ган металу. В этот раз я экономно использовал wash: только на основании и в углублениях лука (которые в реальности были бы отверстиями). Стоит помнить также о драй браше на камнях. Эта техника настолько потрясающая, что должна быть незаконной.

source: Watch [Vince's video](https://youtu.be/W8uCKcF3aUc), if you haven't already. No, but really. He's a top-tier mini painter.
pl: Obejrzyj [film Vince'a](https://youtu.be/W8uCKcF3aUc), jeśli jeszcze tego nie zrobiłeś. Naprawdę warto. To malarz figurek najwyższej klasy.
ru: Посмотри [видео Винса](https://youtu.be/W8uCKcF3aUc), если ещё не видел. Действительно стоит. Это художник миниатюр высочайшего класса.

source: It actually helps to put your mini under a strong beam of light to see where highlights and shadows should be.
pl: Ustawianie figurki pod silnym strumieniem światła jest bardzo pomocne. Można zobaczyć, gdzie powinny znaleźć się highlight'y i cienie.
ru: Размещение миниатюры под сильным лучом света очень полезно. Можно увидеть, где должны располагаться хайлайты и тени.

source: Do your friend who hasn't painted in a while a favor, and invite them over for a painting session.
pl: Zrób przysługę znajomemu, który dawno nie malował, i zaproś go na wspólną sesję malowania.
ru: Сделай одолжение своему другу, который давно не рисовал, и пригласи его на совместный сеанс покраски.
