Repository: qwrtln/homm3bg-painting
Catalog: localizations/troll.md/*.po
Languages: ru

source: Neutrals
ru: Нейтральные

source: Second painted Heroes unit.
ru: Второй покрашенный юнит Heroes.

source: https://paint-h3.qwrtln.nl/assets/images/troll_front.jpg
ru: https://ru.paint-h3.qwrtln.nl/assets/images/troll_front.jpeg

source: Gold
ru: Золотые

source: Troll
ru: Тролль

source: Here's my second neutral unit.
ru: Мой второй нейтральный юнит.

source: Green skin is supposedly easier to paint than human skin. Well, that crusty texture was not as straightforward (it involved some wonky dry-brushing). Nevertheless, those yellow-tinted highlights turned out really well. This was also my first attempt at painting facial details like eyeballs and teeth. I'm really glad it worked out on the first try.
ru: Зеленую кожу, как говорят, красить легче, чем человеческую. Однако корка на текстуре оказалась не такой простой (для нее понадобился немного кривоватый dry-brushing). Тем не менее желтоватые блики получились очень хорошо. Это также была моя первая попытка покрасить детали лица, а именно глаза и зубы. Очень рад, что все получилось с первого раза.

source: Painting time: 5 h
ru: Время покраски: 5 ч

source: See Trolls on the [Wiki](https://homm3bg.wiki/units/trolls).
ru: Посмотрите Троллей на [Вики](https://homm3bg.wiki/units/trolls).

source: <details><summary>Click to see the unboxing video</summary> <video width="1280" height="720" controls preload="none"> <source src="/assets/videos/troll.webm" type="video/webm"> </video> </details>
ru: <details><summary>Нажмите, чтобы посмотреть видео с распаковки</summary> <video width="1280" height="720" controls preload="none"> <source src="/assets/videos/troll.webm" type="video/webm"> </video> </details>
