Repository: qwrtln/homm3bg-painting
Catalog: localizations/peasant.md/*.po
Languages: pl, ru

source: Becoming Pieter Bruegel for one afternoon.
pl: Jak zostałem Pieterem Bruegelem na jeden wieczór.
ru: Превратиться в Питера Брейгеля на один день.

source: https://paint-h3.qwrtln.nl/assets/images/peasant_front.webp
pl: https://pl.paint-h3.qwrtln.nl/assets/images/peasant_front.webp
ru: https://ru.paint-h3.qwrtln.nl/assets/images/peasant_front.webp

source: Neutrals
pl: Neutralne
ru: Нейтральные

source: Bronze
pl: Brązowe
ru: Коричневые

source: Peasant
pl: Chłop
ru: Крестьянин

source: <small>Read in another language: [:pl:](https://pl.paint-h3.qwrtln.nl/posts/2024/11/chłop/) [:ru:](https://ru.paint-h3.qwrtln.nl/posts/2024/11/крестьянин/)</small>
pl: <small>Czytaj w innym języku: [:gb:](https://paint-h3.qwrtln.nl/posts/2024/11/peasant/) [:ru:](https://ru.paint-h3.qwrtln.nl/posts/2024/11/крестьянин/)</small>
ru: <small>Читайте на другом языке: [:gb:](https://paint-h3.qwrtln.nl/posts/2024/11/peasant/) [:pl:](https://pl.paint-h3.qwrtln.nl/posts/2024/11/chłop/)</small>

source: Becoming Pieter Bruegel for one afternoon. Let's give this peasant some character before he ends up in the skeleton transformer.
pl: Jak zostałem Pieterem Bruegelem na jeden wieczór. A niech ten chłop choć raz dobrze wygląda, zanim skończy w szkieletorni.
ru: Превращаюсь в Питера Брейгеля на один день. Давайте добавим этому крестьянину немного характера, прежде чем он попадёт в преобразователь скелетов.

source: Painting time: 4 h
pl: Czas malowania: 4 h
ru: Время покраски: 4 ч

source: <details><summary>Click to see the unboxing video</summary> <video width="1280" height="720" controls preload="none"> <source src="/assets/videos/peasant.webm" type="video/webm"> </video> </details>
pl: <details><summary>Kliknij, aby zobaczyć wideo z rozpakowywania</summary> <video width="1280" height="720" controls preload="none"> <source src="/assets/videos/peasant.webm" type="video/webm"> </video> </details>
ru: <details><summary>Нажмите, чтобы посмотреть видео с распаковки</summary> <video width="1280" height="720" controls preload="none"> <source src="/assets/videos/peasant.webm" type="video/webm"> </video> </details>

source: See Peasants on the [Wiki](https://homm3bg.wiki/units/peasants).
pl: Zobacz Chłopów na [Wiki](https://homm3bg.wiki/pl/units/peasants).
ru: Посмотрите Крестьян на [Вики](https://homm3bg.wiki/units/peasants).

source: For the first time, I decided not to follow the colors on the card, as they were too vibrant. An actual peasant would likely wear more muted clothing — violet shirts wouldn’t be in their wardrobe. The mini ended up with earthy, autumn-inspired tones.
pl: Po raz pierwszy postanowiłem nie trzymać się kolorów z karty, ponieważ były zbyt żywe. Prawdziwy chłop raczej nosiłby bardziej stonowane ubranie — fioletowe koszule raczej nie znalazłyby się w jego garderobie. Figurka ostatecznie otrzymała ziemiste, jesienne barwy.
ru: Впервые я решил не придерживаться цветов, указанных на карточке, так как они были слишком яркими. Настоящий крестьянин, скорее всего, носил бы более приглушённую одежду — фиолетовые рубашки точно не вписались бы в его гардероб. Миниатюра в итоге переобрела земляные тона с осенним вдохновением.

source: The Process
pl: Proces
ru: Процесс

source: I used a flat brown for the base of the trousers, pitchfork, and cap, but this wasn’t the best choice. Follwing my wife's suggestion, I brightened the trousers and cap with a bit of orange, while darkening the pitchfork handle.
pl: Użyłem brązu jako bazowego koloru dla spodni, wideł i czapki, ale to nie była najlepsza decyzja. Słuchając rady żony, rozjaśniłem spodnie i czapkę odrobiną pomarańczu, a uchwyt wideł odrobinę przyciemniłem.
ru: Я использовал базовый коричневый цвет в качестве основы для штанов, вил и шапки, но это оказалось не самым удачным решением. По совету жены я осветлил штаны и шапку немного оранжевым, а ручку вил затемнил.

source: The shirt and the ground were too similar in color, making the mini hard to look at. Luckily, there was enough grass, which I dry-brushed with the color I usually use for zombie skin. Even this subdued color helped the mini feel more alive.
pl: Koszula i podstawka były zbyt podobne kolorystycznie, przez co figurka wyglądała zbyt jednolicie. Na szczęście było wystarczająco miejsc z trawą, którą pomalowałem metodą dry-brush kolorem, którego zwykle używam do malowania skóry zombie. Nawet ten stonowany odcień sprawił, że figurka wygląda bardziej żywo.
ru: Рубашка и земля оказались слишком похожими по цвету, из-за чего миниатюра выглядела плохо различимой. К счастью, травы было достаточно, и я нанес на неё dry-brush цветом, который обычно использую для кожи зомби. Даже этот приглушённый оттенок сделал миниатюру более "живой".

source: The pitchfork was painted with gunmetal, with silver edges, and a touch of black ink to tone down the shine. To give the peasant a dirtier look, I used watered-down Dreadful Visage contrast paint as a wash.
pl: Widły zostały pomalowane metalicznym szarym kolorem (gunmetal) z srebrnymi krawędziami i lekkim dodatkiem czarnego tuszu, żeby stonować połysk. Aby nadać chłopu bardziej zabrudzony wygląd, użyłem rozcieńczonej farby kontrastowej Dreadful Visage jako wash.
ru: Вилы были покрашены металлическим серым цветом (gunmetal) с серебряными краями и добавлением немного черного чернила, чтобы приглушить блеск. А чтобы придать крестьянину более грязный вид, я использовал разбавленную краску контраста Dreadful Visage в качестве wash.

source: Conclusion
pl: Wniosek
ru: Вывод

source: My hand is getting steadier. Here's to keeping this up before I run out of easy-to-paint neutral minis.
pl: Moja ręka powoli przestaje drżeć. Oby uspokiła się całkiem, zanim skończą mi się łatwe figurki.
ru: Моя рука постепенно перестает дрожать. Надеюсь, она успокится полностью, пока не закончатся легкие миниатюры.
